zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE247/gcc/startup_MCXE247.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm
/* Exception Handlers */
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    DMA0_DriverIRQHandler
    def_irq_handler    DMA1_DriverIRQHandler
    def_irq_handler    DMA2_DriverIRQHandler
    def_irq_handler    DMA3_DriverIRQHandler
    def_irq_handler    DMA4_DriverIRQHandler
    def_irq_handler    DMA5_DriverIRQHandler
    def_irq_handler    DMA6_DriverIRQHandler
    def_irq_handler    DMA7_DriverIRQHandler
    def_irq_handler    DMA8_DriverIRQHandler
    def_irq_handler    DMA9_DriverIRQHandler
    def_irq_handler    DMA10_DriverIRQHandler
    def_irq_handler    DMA11_DriverIRQHandler
    def_irq_handler    DMA12_DriverIRQHandler
    def_irq_handler    DMA13_DriverIRQHandler
    def_irq_handler    DMA14_DriverIRQHandler
    def_irq_handler    DMA15_DriverIRQHandler
    def_irq_handler    DMA_Error_DriverIRQHandler
    def_irq_handler    MCM_IRQHandler
    def_irq_handler    FTFC_CMD_IRQHandler
    def_irq_handler    FTFC_Read_Collision_IRQHandler
    def_irq_handler    LVD_LVW_IRQHandler
    def_irq_handler    FTFM_Fault_IRQHandler
    def_irq_handler    WDOG_EWM_IRQHandler
    def_irq_handler    RCM_IRQHandler
    def_irq_handler    LPI2C0_Master_DriverIRQHandler
    def_irq_handler    LPI2C0_Slave_DriverIRQHandler
    def_irq_handler    LPSPI0_DriverIRQHandler
    def_irq_handler    LPSPI1_DriverIRQHandler
    def_irq_handler    LPSPI2_DriverIRQHandler
    def_irq_handler    LPI2C1_Master_DriverIRQHandler
    def_irq_handler    LPI2C1_Slave_DriverIRQHandler
    def_irq_handler    LPUART0_DriverIRQHandler
    def_irq_handler    Reserved48_IRQHandler
    def_irq_handler    LPUART1_DriverIRQHandler
    def_irq_handler    Reserved50_IRQHandler
    def_irq_handler    LPUART2_DriverIRQHandler
    def_irq_handler    Reserved52_IRQHandler
    def_irq_handler    Reserved53_IRQHandler
    def_irq_handler    Reserved54_IRQHandler
    def_irq_handler    ADC0_IRQHandler
    def_irq_handler    ADC1_IRQHandler
    def_irq_handler    CMP0_IRQHandler
    def_irq_handler    Reserved58_IRQHandler
    def_irq_handler    Reserved59_IRQHandler
    def_irq_handler    ERM_single_fault_IRQHandler
    def_irq_handler    ERM_double_fault_IRQHandler
    def_irq_handler    RTC_IRQHandler
    def_irq_handler    RTC_Seconds_IRQHandler
    def_irq_handler    LPIT0_Ch0_IRQHandler
    def_irq_handler    LPIT0_Ch1_IRQHandler
    def_irq_handler    LPIT0_Ch2_IRQHandler
    def_irq_handler    LPIT0_Ch3_IRQHandler
    def_irq_handler    PDB0_IRQHandler
    def_irq_handler    Reserved69_IRQHandler
    def_irq_handler    Reserved70_IRQHandler
    def_irq_handler    I2S1_Tx_DriverIRQHandler
    def_irq_handler    I2S1_Rx_DriverIRQHandler
    def_irq_handler    SCG_IRQHandler
    def_irq_handler    LPTMR0_IRQHandler
    def_irq_handler    PORTA_IRQHandler
    def_irq_handler    PORTB_IRQHandler
    def_irq_handler    PORTC_IRQHandler
    def_irq_handler    PORTD_IRQHandler
    def_irq_handler    PORTE_IRQHandler
    def_irq_handler    SWI_IRQHandler
    def_irq_handler    QSPI_Ored_DriverIRQHandler
    def_irq_handler    Reserved82_IRQHandler
    def_irq_handler    Reserved83_IRQHandler
    def_irq_handler    PDB1_IRQHandler
    def_irq_handler    FLEXIO_DriverIRQHandler
    def_irq_handler    I2S0_Tx_DriverIRQHandler
    def_irq_handler    I2S0_Rx_DriverIRQHandler
    def_irq_handler    ENET_1588_Timer_DriverIRQHandler
    def_irq_handler    ENET_Transmit_DriverIRQHandler
    def_irq_handler    ENET_Receive_DriverIRQHandler
    def_irq_handler    ENET_Error_DriverIRQHandler
    def_irq_handler    ENET_Graceful_Stop_DriverIRQHandler
    def_irq_handler    ENET_Wake_DriverIRQHandler
    def_irq_handler    CAN0_ORed_DriverIRQHandler
    def_irq_handler    CAN0_Error_DriverIRQHandler
    def_irq_handler    CAN0_Wake_Up_DriverIRQHandler
    def_irq_handler    CAN0_ORed_0_15_MB_DriverIRQHandler
    def_irq_handler    CAN0_ORed_16_31_MB_DriverIRQHandler
    def_irq_handler    Reserved99_IRQHandler
    def_irq_handler    Reserved100_IRQHandler
    def_irq_handler    CAN1_ORed_DriverIRQHandler
    def_irq_handler    CAN1_Error_DriverIRQHandler
    def_irq_handler    Reserved103_IRQHandler
    def_irq_handler    CAN1_ORed_0_15_MB_DriverIRQHandler
    def_irq_handler    CAN1_ORed_16_31_MB_DriverIRQHandler
    def_irq_handler    Reserved106_IRQHandler
    def_irq_handler    Reserved107_IRQHandler
    def_irq_handler    CAN2_ORed_DriverIRQHandler
    def_irq_handler    CAN2_Error_DriverIRQHandler
    def_irq_handler    Reserved110_IRQHandler
    def_irq_handler    CAN2_ORed_0_15_MB_DriverIRQHandler
    def_irq_handler    CAN2_ORed_16_31_MB_DriverIRQHandler
    def_irq_handler    Reserved113_IRQHandler
    def_irq_handler    Reserved114_IRQHandler
    def_irq_handler    FTM0_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM0_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM0_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM0_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM0_Fault_IRQHandler
    def_irq_handler    FTM0_Ovf_Reload_IRQHandler
    def_irq_handler    FTM1_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM1_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM1_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM1_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM1_Fault_IRQHandler
    def_irq_handler    FTM1_Ovf_Reload_IRQHandler
    def_irq_handler    FTM2_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM2_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM2_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM2_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM2_Fault_IRQHandler
    def_irq_handler    FTM2_Ovf_Reload_IRQHandler
    def_irq_handler    FTM3_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM3_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM3_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM3_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM3_Fault_IRQHandler
    def_irq_handler    FTM3_Ovf_Reload_IRQHandler
    def_irq_handler    FTM4_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM4_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM4_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM4_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM4_Fault_IRQHandler
    def_irq_handler    FTM4_Ovf_Reload_IRQHandler
    def_irq_handler    FTM5_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM5_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM5_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM5_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM5_Fault_IRQHandler
    def_irq_handler    FTM5_Ovf_Reload_IRQHandler
    def_irq_handler    FTM6_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM6_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM6_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM6_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM6_Fault_IRQHandler
    def_irq_handler    FTM6_Ovf_Reload_IRQHandler
    def_irq_handler    FTM7_Ch0_Ch1_IRQHandler
    def_irq_handler    FTM7_Ch2_Ch3_IRQHandler
    def_irq_handler    FTM7_Ch4_Ch5_IRQHandler
    def_irq_handler    FTM7_Ch6_Ch7_IRQHandler
    def_irq_handler    FTM7_Fault_IRQHandler
    def_irq_handler    FTM7_Ovf_Reload_IRQHandler

    .end
